#-*-coding:utf-8-*-
#########学生基本信息############
#姓名:齐佳民
#学号:1403050116
#班级：通风14-1班
##############题目###############
#诗歌
############代码#################
print '               忆故乡--酸汤子'
print '朦胧中，回到故乡，故乡的小河在月色下闪着磷光，'
print '哗啦啦地流淌着好像在欢迎我回来，溅起的浪花仿'
print '佛儿时的伙伴拉着我的手话着离别时光。'
print 
print '踏上这片热土，回到久别的故乡心是热的泪水也是滚'
print '烫的，突然一群小伙伴不知道从哪里飞出来，将我团团'
print '围住。啊！故乡的月色迷人，故乡的人啊格外亲！'
print 
print '被小伙伴们推搡着，走进谁的家？锅灶上冒着热气，是'
print '谁的妈妈在忙碌着？深深地吸一口气，哇！真香，那'
print '可是我搜肠刮肚寻觅的味道，只见一锅酸汤子在沸水里'
print '滚动着，我们坐在饭桌前静静地等一碗一碗地酸汤子摆'
print '在我们面前。'
print
print '一碗酸汤子勾起我儿时美好的回忆，一碗酸汤子让我这'
print '个漂泊在外的游子梦归故里。'
print '                            图/文木子花飘香'